In [34]:
# Create a Datetime index containing all the weekdays days of year 2019 and assign a random number to each of them in a dataframe. 
import pandas as pd 
import random

sr = pd.date_range('2019-01-01','2019-12-31',freq='B')
randnum = [random.randint(0,100000000) for x in range(261)]
df = pd.DataFrame(sr,randnum)
print (df)

                  0
27915225 2019-01-01
8547328  2019-01-02
30466433 2019-01-03
29201583 2019-01-04
55629032 2019-01-07
...             ...
40066993 2019-12-25
94579325 2019-12-26
60198496 2019-12-27
55110674 2019-12-30
46252351 2019-12-31

[261 rows x 1 columns]

In [1]:
# Given Pandas series , height = [23,42,55] and weight = [71,32,48] . Create a dataframe with height and weight as column names. 
import pandas as pd 
height = [23,42,55]
weight = [71,32,48]
data = {'height': height, 'weight': weight}
df = pd.DataFrame(data)
print (df.head())
# this question is around "To create DataFrame from dict of narray/list"

   height  weight
0      23      71
1      42      32
2      55      48

In [25]:
# How to get the items of series A not present in series B .From ser1 remove items present in ser2.
# ser1 = pd.series([2,3,4,5])
# ser2 = pd.series([5,6,7,8])

import pandas as pd
ser1 = pd.Series([2,3,4,5])
ser2 = pd.Series([5,6,7,8])
print (ser1)
index_=['a','b','c','d']
ser1.index = index_
ser2.index = index_
ser1.drop(ser1[ser1.isin(ser2) == True].index,inplace=True)
print (ser1)

0    2
1    3
2    4
3    5
dtype: int64
a    2
b    3
c    4
dtype: int64

In [ ]:
# Questions on Titanic Dataset : (All below)

In [3]:
# Compute the minimum, 25th percentile, median, 75th, and maximum of age in titanic dataset
import pandas as pd

titanic_data = pd.read_csv(r"C:\Users\ramsj\Desktop\DSB8\latest end to end datasets\end to end data sets\titanic.csv")
titanic_data.Age.describe().loc[['min','25%', '75%', 'max']]
#titanic_data.Age.min()
#titanic_data.Age.quantile([0.25,0.75])
#titanic_data.Age.max()

min     0.420
25%    20.125
75%    38.000
max    80.000
Name: Age, dtype: float64

In [21]:
# How to get frequency counts of unique items of a series? Calculate the frequency counts of ‘SibSp’ column in titanic Dataset
import pandas as pd

titanic_data = pd.read_csv(r"C:\Users\ramsj\Desktop\DSB8\latest end to end datasets\end to end data sets\titanic.csv")
#titanic_data['SibSp'].value_counts()
#titanic_data.groupby('SibSp')['SibSp'].count()
#titanic_data.groupby('SibSp')['SibSp'].describe()
titanic_data.groupby('SibSp')['SibSp'].size()
# groupby vs value_counts vs size - different meaning and need careful usuage

       count  mean  std  min  25%  50%  75%  max
SibSp
0      608.0   0.0  0.0  0.0  0.0  0.0  0.0  0.0
1      209.0   1.0  0.0  1.0  1.0  1.0  1.0  1.0
2       28.0   2.0  0.0  2.0  2.0  2.0  2.0  2.0
3       16.0   3.0  0.0  3.0  3.0  3.0  3.0  3.0
4       18.0   4.0  0.0  4.0  4.0  4.0  4.0  4.0
5        5.0   5.0  0.0  5.0  5.0  5.0  5.0  5.0
8        7.0   8.0  0.0  8.0  8.0  8.0  8.0  8.0

In [144]:
# Keep only top 2 most frequent values as it is and replace everything else as ‘Other’ in ‘Embarked’ column of titanic dataset
import pandas as pd

titanic_data = pd.read_csv(r"C:\Users\ramsj\Desktop\DSB8\latest end to end datasets\end to end data sets\titanic.csv")
df = titanic_data['Embarked'].value_counts().rank(ascending=False).reset_index()
#reset_index is for chaning to dataframe from series
df2 = df.loc[df['Embarked'] > 2]
titanic_data.loc[titanic_data['Embarked'].isin(df2['index']), 'Embarked'] = 'Other'
#titanic_data['Embarked'].unique()
titanic_data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Other

In [59]:
# Bin the price column in titanic data set into 5 equal groups and get counts of each bin
import pandas as pd

titanic_data = pd.read_csv(r"C:\Users\ramsj\Desktop\DSB8\latest end to end datasets\end to end data sets\titanic.csv")
pd.qcut(titanic_data['Fare'], q=5).value_counts()

(7.854, 10.5]        184
(21.679, 39.688]     180
(-0.001, 7.854]      179
(39.688, 512.329]    176
(10.5, 21.679]       172
Name: Fare, dtype: int64

In [72]:
# Count the number of missing values in each column?
import pandas as pd

titanic_data = pd.read_csv(r"C:\Users\ramsj\Desktop\DSB8\latest end to end datasets\end to end data sets\titanic.csv")
#titanic_data.isnull().sum().sum()
titanic_data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [43]:
# Get the row number of the 5th largest value in the Age column of titanic dataset?

import pandas as pd

titanic_data = pd.read_csv(r"C:\Users\ramsj\Desktop\DSB8\latest end to end datasets\end to end data sets\titanic.csv")
titanic_data['AgeRank'] = titanic_data['Age'].rank(ascending=False)
#titanic_data[titanic_data['AgeRank']==5]
titanic_data.loc[titanic_data['AgeRank']==5].index.values

array([116], dtype=int64)

In [ ]:
#  Normalize all columns in a dataframe?

In [41]:
# Get the indices of items of ser2 in ser1 as a list.
# ser1 = pd.series([10,9,6,5,3,1,12,8,13])
# ser2 = pd.series([1,3,10,13])

import pandas as pd
ser1 = pd.Series([10,9,6,5,3,1,12,8,13])
ser2 = pd.Series([1,3,10,13])
index_1=['a','b','c','d','e','f','g','h','i']
index_2=['0','1','2','3']
ser1.index = index_1
ser2.index = index_2
print(ser1[ser1.isin(ser2) == True].index)

Index(['a', 'e', 'f', 'i'], dtype='object')

In [ ]:
# How to convert a series of date-strings to a timeseries?
# ['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20']

In [ ]:
# Get the day of month, week number, day of year and day of week from ser.
#ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])

In [ ]:
# Compute the euclidean distance between series (points) p and q, without using a packaged formula.
# p = pd.series([1,2,3,4,5,6,7,8,9,10])
# q = pd.series([10,9,8,7,6,5,4,3,2,1])
# Desired Output - 18.165

In [47]:
# How to create a TimeSeries starting ‘2000-01-01’ and 10 weekends (saturdays/sundays)
import pandas as pd 
print(pd.date_range('2000-01-01',10,freq='D'))
sr = pd.Series(pd.date_range('2000-01-01',10,freq='D'))
print (sr)
df = pd.DataFrame(sr)
print (df)

DatetimeIndex([], dtype='datetime64[ns]', freq='D')
Series([], dtype: datetime64[ns])
Empty DataFrame
Columns: [0]
Index: []

In [ ]:
# Import every 50th row of BostonHousing dataset as a dataframe.